Maybe I am wrong here but I tested and still see this failing. Other than removing the dependency did anything else change with the resource? 

```
resource "bigip_ltm_node" "nodes" {
  count       = var.node_count
  name        = "/${local.partition}/${upper(element(local.node_names, count.index))}"
  address     = element(local.node_ips, count.index)
  description = "Deployed by Terraform"
}

resource "bigip_ltm_pool" "pool" {
  name                = "/${local.partition}/${var.vip_fqdn}_k8s_${local.pool_port}_pool"
  monitors            = local.monitor
  allow_nat           = "yes"
  allow_snat          = "yes"
  load_balancing_mode = "round-robin"
  description         = "Deployed by Terraform"
}

resource "bigip_ltm_pool_attachment" "attach" {
  count      = var.node_count
  pool       = bigip_ltm_pool.pool.name
  node       = "${bigip_ltm_node.nodes[count.index].name}:${local.pool_port}"
}
```
Results in this error when changing an IP address of a node 

The Plan shows its will recreate the node but not the attachment:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_vips.bigip_ltm_node.nodes[2] must be replaced
-/+ resource "bigip_ltm_node" "nodes" {
      ~ address          = "10.129.82.192" -> "10.129.82.193" # forces replacement
      ~ connection_limit = 0 -> (known after apply)
        description      = "Deployed by Terraform"
      ~ dynamic_ratio    = 1 -> (known after apply)
      ~ id               = "/AUTO-CONTAINERS-DEVTST/TMP01TMPD1VM302" -> (known after apply)
        monitor          = "/Common/icmp"
        name             = "/AUTO-CONTAINERS-DEVTST/TMP01TMPD1VM302"
      ~ rate_limit       = "disabled" -> (known after apply)
      ~ ratio            = 1 -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

And the apply fails with 
```
module.master_vips.bigip_ltm_node.nodes[2]: Destroying... [id=/AUTO-CONTAINERS-DEVTST/TMP01TMPD1VM302]

Error: HTTP 400 :: {"code":400,"message":"01070110:3: Node address '/AUTO-CONTAINERS-DEVTST/TMP01TMPD1VM302' is referenced by a member of pool '/AUTO-CONTAINERS-DEVTST/tmp01-int-test-dev-xxxxxxxxxx.com_k8s_6443_pool'.","errorStack":[],"apiError":3}
```

